hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/ble/nrf_ble_scan/nrf_ble_scan.c
/**
    Copyright (c) 2018, Nordic Semiconductor ASA

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
    are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
      list of conditions and the following disclaimer.

    2. Redistributions in binary form, except as embedded into a Nordic
      Semiconductor ASA integrated circuit in a product or a software update for
      such product, must reproduce the above copyright notice, this list of
      conditions and the following disclaimer in the documentation and/or other
      materials provided with the distribution.

    3. Neither the name of Nordic Semiconductor ASA nor the names of its
      contributors may be used to endorse or promote products derived from this
      software without specific prior written permission.

    4. This software, with or without modification, must only be used with a
      Nordic Semiconductor ASA integrated circuit.

    5. Any software provided in binary form under this license must not be reverse
      engineered, decompiled, modified and/or disassembled.

    THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
    OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
    OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
    GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
    HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
    LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
    OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/

#include "sdk_common.h"
#if NRF_MODULE_ENABLED(NRF_BLE_SCAN)

#include "sdk_config.h"
#include <stdlib.h>

#include "nrf_ble_scan.h"

#include <string.h>
#include "app_error.h"
#include "nrf_assert.h"
#include "sdk_macros.h"
#include "ble_advdata.h"

#define NRF_LOG_MODULE_NAME ble_scan
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();


/** @brief Function for establishing the connection with a device.

    @details Connection is established if @ref NRF_BLE_SCAN_EVT_FILTER_MATCH
            or @ref NRF_BLE_SCAN_EVT_WHITELIST_ADV_REPORT occurs and the module was
            initialized in the automatic connection mode. This function can generate an event
            to the main application when @ref sd_ble_gap_connect is used inside the function and it returns value
            that is different than @ref NRF_SUCCESS.

    @param[in] p_scan_ctx   Pointer to the Scanning Module instance.
    @param[in] p_adv_report Advertising data.
*/
static void nrf_ble_scan_connect_with_target(nrf_ble_scan_t           const *const p_scan_ctx,
                                             ble_gap_evt_adv_report_t const *const p_adv_report)
{
    ret_code_t err_code;
    scan_evt_t scan_evt;
    
    // For readability.
    ble_gap_addr_t const         *p_addr        = &p_adv_report->peer_addr;
    ble_gap_scan_params_t const *p_scan_params = &p_scan_ctx->scan_params;
    ble_gap_conn_params_t const *p_conn_params = &p_scan_ctx->conn_params;
    uint8_t                       con_cfg_tag   = p_scan_ctx->conn_cfg_tag;
    
    // Return if the automatic connection is disabled.
    if(!p_scan_ctx->connect_if_match)
        return;
        
    // Stop scanning.
    nrf_ble_scan_stop();
    
    memset(&scan_evt, 0, sizeof(scan_evt));
    
    // Establish connection.
    err_code = sd_ble_gap_connect(p_addr,
                                  p_scan_params,
                                  p_conn_params,
                                  con_cfg_tag);
                                  
    NRF_LOG_DEBUG("Connecting");
    
    scan_evt.scan_evt_id                    = NRF_BLE_SCAN_EVT_CONNECTING_ERROR;
    scan_evt.params.connecting_err.err_code = err_code;
    
    NRF_LOG_DEBUG("Connection status: %d", err_code);
    
    // If an error occurred, send an event to the event handler.
    if((err_code != NRF_SUCCESS) && (p_scan_ctx->evt_handler != NULL))
        p_scan_ctx->evt_handler(&scan_evt);
        
}


/** @brief Function for decoding the BLE address type.

    @param[in] p_addr    The BLE address.

    @return              Address type, or an error if the address type is incorrect, that is it does not match @ref BLE_GAP_ADDR_TYPES.

*/
static uint16_t nrf_ble_scan_address_type_decode(uint8_t const *p_addr)
{
    uint8_t addr_type = p_addr[0];
    
    // See Bluetooth Core Specification Vol 6, Part B, section 1.3.
    addr_type  = addr_type >> 6;
    addr_type &= 0x03;
    
    // Check address type.
    switch(addr_type)
    {
        case 0:
        {
            return BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE;
        }
        
        case 1:
        {
            return BLE_GAP_ADDR_TYPE_PUBLIC;
        }
        
        case 2:
        {
            return BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE;
        }
        
        case 3:
        {
            return BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
        }
        
        default:
        {
            return BLE_ERROR_GAP_INVALID_BLE_ADDR;
        }
    }
}


#if (NRF_BLE_SCAN_FILTER_ENABLE == 1)
#if (NRF_BLE_SCAN_ADDRESS_CNT > 0)

/** @brief Function for searching for the provided address in the advertisement packets.

    @details Use this function to parse the received advertising data for the provided address.


    @param[in]   p_adv_report   Advertising data to parse.
    @param[in]   p_addr         Address to search for. The address length must correspond to @ref BLE_GAP_ADDR_LEN.

    @return   True if the provided address was found, false otherwise.
*/
static bool find_peer_addr(ble_gap_evt_adv_report_t const *const p_adv_report,
                           ble_gap_addr_t const                  *p_addr)
{
    if(p_addr->addr_type == p_adv_report->peer_addr.addr_type)
    {
        // Compare addresses.
        if(memcmp(p_addr->addr,
                  p_adv_report->peer_addr.addr,
                  sizeof(p_adv_report->peer_addr.addr)) == 0)
            return true;
    }
    
