hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/ble/nrf_ble_scan/nrf_ble_scan.c
    return false;
}


/** @brief Function for comparing the provided address with the addresses of the advertising devices.

    @param[in] p_adv_report    Advertising data to parse.
    @param[in] p_scan_ctx      Pointer to the Scanning Module instance.

    @retval True when the address matches with the addresses of the advertising devices. False otherwise.
*/
static bool adv_addr_compare(ble_gap_evt_adv_report_t const *const p_adv_report,
                             nrf_ble_scan_t const *const           p_scan_ctx)
{
    ble_gap_addr_t const *p_addr  = p_scan_ctx->scan_filters.addr_filter.target_addr;
    uint8_t                counter = p_scan_ctx->scan_filters.addr_filter.addr_cnt;
    
    for(uint8_t index = 0; index < counter; index++)
    {
        // Search for address.
        if(find_peer_addr(p_adv_report, &p_addr[index]))
            return true;
    }
    
    return false;
}


/** @brief Function for adding target address to the scanning filter.

    @param[in]     p_addr            Target address in the format required by the SoftDevice. If you need to convert the address, use @ref nrf_ble_scan_copy_addr_to_sd_gap_addr. The address length must correspond to @ref BLE_GAP_ADDR_LEN.
    @param[in,out] p_scan_ctx        Pointer to the Scanning Module instance.

    @retval NRF_SUCCESS                    If the filter is added successfully or if you try to add a filter that was already added before.
    @retval NRF_ERROR_NO_MEMORY            If the number of available filters is exceeded.
    @retval BLE_ERROR_GAP_INVALID_BLE_ADDR If the BLE address type is invalid.
*/
static ret_code_t nrf_ble_scan_addr_filter_add(nrf_ble_scan_t *const p_scan_ctx,
                                               uint8_t        const *p_addr)
{
    ble_gap_addr_t *p_addr_filter = p_scan_ctx->scan_filters.addr_filter.target_addr;
    uint8_t         *p_counter     = &p_scan_ctx->scan_filters.addr_filter.addr_cnt;
    uint8_t          index;
    uint16_t         addr_type;
    uint8_t          temp_addr[BLE_GAP_ADDR_LEN];
    
    // If no memory for filter.
    if(*p_counter >= NRF_BLE_SCAN_ADDRESS_CNT)
        return NRF_ERROR_NO_MEM;
        
    // Check for duplicated filter.
    for(index = 0; index < NRF_BLE_SCAN_ADDRESS_CNT; index++)
    {
        if(!memcmp(p_addr_filter[index].addr, p_addr, BLE_GAP_ADDR_LEN))
            return NRF_SUCCESS;
    }
    
    // Inverting the address.
    for(uint8_t i = 0; i < BLE_GAP_ADDR_LEN; i++)
        temp_addr[i] = p_addr[(BLE_GAP_ADDR_LEN - 1) - i];
        
    // Decode address type.
    addr_type = nrf_ble_scan_address_type_decode(temp_addr);
    
    if(addr_type == BLE_ERROR_GAP_INVALID_BLE_ADDR)
        return BLE_ERROR_GAP_INVALID_BLE_ADDR;
        
    // Add target address to filter.
    p_addr_filter[*p_counter].addr_type = (uint8_t)addr_type;
    
    for(uint8_t i = 0; i < BLE_GAP_ADDR_LEN; i++)
        p_addr_filter[*p_counter].addr[i] = p_addr[i];
        
    NRF_LOG_DEBUG("Filter set on address type %i, address 0x",
                  p_addr_filter[*p_counter].addr_type);
                  
    for(index = 0; index < BLE_GAP_ADDR_LEN; index++)
        NRF_LOG_DEBUG("%x", p_addr_filter[*p_counter].addr[index]);
        
    NRF_LOG_DEBUG("\n\r");
    
    // Increase the address filter counter.
    *p_counter += 1;
    
    return NRF_SUCCESS;
}


#endif // NRF_BLE_SCAN_ADDRESS_CNT


#if (NRF_BLE_SCAN_NAME_CNT > 0)
/** @brief Function for comparing the provided name with the advertised name.

    @param[in] p_adv_report    Advertising data to parse.
    @param[in] p_scan_ctx      Pointer to the Scanning Module instance.

    @retval True when the names match. False otherwise.
*/
static bool adv_name_compare(ble_gap_evt_adv_report_t const *p_adv_report,
                             nrf_ble_scan_t     const *const p_scan_ctx)
{
    nrf_ble_scan_name_filter_t const *p_name_filter = &p_scan_ctx->scan_filters.name_filter;
    uint8_t                            counter       =
        p_scan_ctx->scan_filters.name_filter.name_cnt;
    uint8_t  index;
    uint16_t data_len;
    
    data_len = p_adv_report->data.len;
    
    // Compare the name found with the name filter.
    for(index = 0; index < counter; index++)
    {
        if(ble_advdata_name_find(p_adv_report->data.p_data,
                                 data_len,
                                 p_name_filter->target_name[index]))
            return true;
    }
    
    return false;
}


/** @brief Function for adding name of the peripheral to the scanning filter.

    @param[in]     p_name            Peripheral name.
    @param[in,out] p_scan_ctx        Pointer to the Scanning Module instance.

    @retval NRF_SUCCESS              If the filter is added successfully or if you try to add a filter that was already added before.
    @retval NRF_ERROR_NULL           If a NULL pointer is passed as input.
    @retval NRF_ERROR_DATA_SIZE      If the name filter length is too long. The maximum filter name length corresponds to @ref NRF_BLE_SCAN_NAME_MAX_LEN.
    @retval NRF_ERROR_NO_MEMORY      If the number of available filters is exceeded.
*/
static ret_code_t nrf_ble_scan_name_filter_add(nrf_ble_scan_t *const p_scan_ctx,
                                               char           const *p_name)
{
    uint8_t   index;
    uint8_t *counter  = &p_scan_ctx->scan_filters.name_filter.name_cnt;
    uint8_t   name_len = strlen(p_name);
    
    // Check the name length.
    if((name_len == 0) || (name_len > NRF_BLE_SCAN_NAME_MAX_LEN))
        return NRF_ERROR_DATA_SIZE;
        
    // If no memory for filter.
    if(*counter >= NRF_BLE_SCAN_NAME_CNT)
        return NRF_ERROR_NO_MEM;
        
    // Check for duplicated filter.
    for(index = 0; index < NRF_BLE_SCAN_NAME_CNT; index++)
    {
        if(!strcmp(p_scan_ctx->scan_filters.name_filter.target_name[index], p_name))
            return NRF_SUCCESS;
    }
    
    // Add name to filter.
    memcpy(p_scan_ctx->scan_filters.name_filter.target_name[(*counter)++],
           p_name,
           strlen(p_name));
           
