hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/ble/nrf_ble_scan/nrf_ble_scan.c
    NRF_LOG_DEBUG("Adding filter on %s name", p_name);
    
    return NRF_SUCCESS;
}


#endif // NRF_BLE_SCAN_NAME_CNT


#if (NRF_BLE_SCAN_SHORT_NAME_CNT > 0)
/** @brief Function for comparing the provided short name with the advertised short name.

    @param[in] p_adv_report    Advertising data to parse.
    @param[in] p_scan_ctx      Pointer to the Scanning Module instance.

    @retval True when the names match. False otherwise.
*/
static bool adv_short_name_compare(ble_gap_evt_adv_report_t const *const p_adv_report,
                                   nrf_ble_scan_t           const *const p_scan_ctx)
{
    nrf_ble_scan_short_name_filter_t const *p_name_filter =
        &p_scan_ctx->scan_filters.short_name_filter;
    uint8_t  counter = p_scan_ctx->scan_filters.short_name_filter.name_cnt;
    uint8_t  index;
    uint16_t data_len;
    
    data_len = p_adv_report->data.len;
    
    // Compare the name found with the name filters.
    for(index = 0; index < counter; index++)
    {
        if(ble_advdata_short_name_find(p_adv_report->data.p_data,
                                       data_len,
                                       p_name_filter->short_name[index].short_target_name,
                                       p_name_filter->short_name[index].short_name_min_len))
            return true;
    }
    
    return false;
}


/** @brief Function for adding the short name of the peripheral to the scanning filter.

    @param[in]     p_short_name      Short name of the peripheral.
    @param[in,out] p_scan_ctx        Pointer to the Scanning Module instance.

    @retval NRF_SUCCESS              If the filter is added successfully or if you try to add a filter that was already added before.
    @retval NRF_ERROR_NULL           If a NULL pointer is passed as input.
    @retval NRF_ERROR_DATA_SIZE      If the name filter length is too long. The maximum filter name length corresponds to @ref NRF_BLE_SCAN_SHORT_NAME_MAX_LEN.
    @retval NRF_ERROR_NO_MEMORY      If the number of available filters is exceeded.
*/
static ret_code_t nrf_ble_scan_short_name_filter_add(nrf_ble_scan_t             *const p_scan_ctx,
                                                     nrf_ble_scan_short_name_t const *p_short_name)
{
    uint8_t   index;
    uint8_t *p_counter =
        &p_scan_ctx->scan_filters.short_name_filter.name_cnt;
    nrf_ble_scan_short_name_filter_t *p_short_name_filter =
        &p_scan_ctx->scan_filters.short_name_filter;
    uint8_t name_len = strlen(p_short_name->p_short_name);
    
    // Check the name length.
    if((name_len == 0) || (name_len > NRF_BLE_SCAN_SHORT_NAME_MAX_LEN))
        return NRF_ERROR_DATA_SIZE;
        
    // If no memory for filter.
    if(*p_counter >= NRF_BLE_SCAN_SHORT_NAME_CNT)
        return NRF_ERROR_NO_MEM;
        
    // Check for duplicated filter.
    for(index = 0; index < NRF_BLE_SCAN_SHORT_NAME_CNT; index++)
    {
        if(!strcmp(p_short_name_filter->short_name[index].short_target_name,
                   p_short_name->p_short_name))
            return NRF_SUCCESS;
    }
    
    // Add name to the filter.
    p_short_name_filter->short_name[(*p_counter)].short_name_min_len =
        p_short_name->short_name_min_len;
    memcpy(p_short_name_filter->short_name[(*p_counter)++].short_target_name,
           p_short_name->p_short_name,
           strlen(p_short_name->p_short_name));
           
    NRF_LOG_DEBUG("Adding filter on %s name", p_short_name->p_short_name);
    
    return NRF_SUCCESS;
}


#endif


#if (NRF_BLE_SCAN_UUID_CNT > 0)
/** @brief Function for comparing the provided UUID with the UUID in the advertisement packets.

    @param[in]   p_adv_report   Advertising data to parse.
    @param[in]   p_scan_ctx     Pointer to the Scanning Module instance.

    @return      True if the UUIDs match. False otherwise.
*/
static bool adv_uuid_compare(ble_gap_evt_adv_report_t const *const p_adv_report,
                             nrf_ble_scan_t           const *const p_scan_ctx)
{
    nrf_ble_scan_uuid_filter_t const *p_uuid_filter    = &p_scan_ctx->scan_filters.uuid_filter;
    bool const                         all_filters_mode = p_scan_ctx->scan_filters.all_filters_mode;
    uint8_t const                      counter          =
        p_scan_ctx->scan_filters.uuid_filter.uuid_cnt;
    uint8_t  index;
    uint16_t data_len;
    uint8_t  uuid_match_cnt = 0;
    
    data_len = p_adv_report->data.len;
    
    for(index = 0; index < counter; index++)
    {
    
        if(ble_advdata_uuid_find(p_adv_report->data.p_data,
                                 data_len,
                                 &p_uuid_filter->uuid[index]))
        {
            uuid_match_cnt++;
            
            // In the normal filter mode, only one UUID is needed to match.
            if(!all_filters_mode)
                break;
        }
        
        else if(all_filters_mode)
            break;
            
        else
        {
            // Do nothing.
        }
    }
    
    // In the multifilter mode, all UUIDs must be found in the advertisement packets.
    if((all_filters_mode && (uuid_match_cnt == counter)) ||
       ((!all_filters_mode) && (uuid_match_cnt > 0)))
        return true;
        
    return false;
}


/** @brief Function for adding UUID to the scanning filter.

    @param[in]     uuid       UUID, 16-bit size.
    @param[in,out] p_scan_ctx Pointer to the Scanning Module instance.

    @retval NRF_SUCCESS              If the scanning started. Otherwise, an error code is returned, also if you tried to add a filter that was already added before.
    @retval NRF_ERROR_NO_MEMORY      If the number of available filters is exceeded.
*/
static ret_code_t nrf_ble_scan_uuid_filter_add(nrf_ble_scan_t *const p_scan_ctx,
                                               ble_uuid_t     const *p_uuid)
{
    ble_uuid_t *p_uuid_filter = p_scan_ctx->scan_filters.uuid_filter.uuid;
    uint8_t     *p_counter     = &p_scan_ctx->scan_filters.uuid_filter.uuid_cnt;
    uint8_t      index;
    
    // If no memory.
    if(*p_counter >= NRF_BLE_SCAN_UUID_CNT)
        return NRF_ERROR_NO_MEM;
        
    // Check for duplicated filter.
    for(index = 0; index < NRF_BLE_SCAN_UUID_CNT; index++)
    {
        if(p_uuid_filter[index].uuid == p_uuid->uuid)
            return NRF_SUCCESS;
    }
    
    // Add UUID to the filter.
    p_uuid_filter[(*p_counter)++] = *p_uuid;
    NRF_LOG_DEBUG("Added filter on UUID %x", p_uuid->uuid);
    
    return NRF_SUCCESS;
}


#endif // NRF_BLE_SCAN_UUID_CNT


#if (NRF_BLE_SCAN_APPEARANCE_CNT)
/** @brief Function for comparing the provided appearance with the appearance in the advertisement packets.

    @param[in]     p_adv_report Advertising data to parse.
    @param[in,out] p_scan_ctx   Pointer to the Scanning Module instance.

    @return      True if the appearances match. False otherwise.
*/
static bool adv_appearance_compare(ble_gap_evt_adv_report_t const *const p_adv_report,
                                   nrf_ble_scan_t           const *const p_scan_ctx)
{
    nrf_ble_scan_appearance_filter_t const *p_appearance_filter =
        &p_scan_ctx->scan_filters.appearance_filter;
    uint8_t const counter =
        p_scan_ctx->scan_filters.appearance_filter.appearance_cnt;
    uint8_t  index;
    uint16_t data_len;
    
    data_len = p_adv_report->data.len;
    
