hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/ble/nrf_ble_scan/nrf_ble_scan.c
    // Verify if the advertised appearance matches the provided appearance.
    for(index = 0; index < counter; index++)
    {
        if(ble_advdata_appearance_find(p_adv_report->data.p_data,
                                       data_len,
                                       &p_appearance_filter->appearance[index]))
            return true;
    }
    
    return false;
}


/** @brief Function for adding appearance to the scanning filter.

    @param[in]     appearance       Appearance to be added.
    @param[in,out] p_scan_ctx       Pointer to the Scanning Module instance.

    @retval NRF_SUCCESS             If the filter is added successfully or if you try to add a filter that was already added before.
    @retval NRF_ERROR_NULL          If a NULL pointer is passed as input.
    @retval NRF_ERROR_NO_MEMORY     If the number of available filters is exceeded.
*/
static ret_code_t nrf_ble_scan_appearance_filter_add(nrf_ble_scan_t *const p_scan_ctx,
                                                     uint16_t               appearance)
{
    uint16_t *p_appearance_filter = p_scan_ctx->scan_filters.appearance_filter.appearance;
    uint8_t   *p_counter           = &p_scan_ctx->scan_filters.appearance_filter.appearance_cnt;
    uint8_t    index;
    
    // If no memory.
    if(*p_counter >= NRF_BLE_SCAN_APPEARANCE_CNT)
        return NRF_ERROR_NO_MEM;
        
    // Check for duplicated filter.
    for(index = 0; index < NRF_BLE_SCAN_APPEARANCE_CNT; index++)
    {
        if(p_appearance_filter[index] == appearance)
            return NRF_SUCCESS;
    }
    
    // Add appearance to the filter.
    p_appearance_filter[(*p_counter)++] = appearance;
    NRF_LOG_DEBUG("Added filter on appearance %x", appearance);
    return NRF_SUCCESS;
}


#endif // NRF_BLE_SCAN_APPEARANCE_CNT


ret_code_t nrf_ble_scan_filter_set(nrf_ble_scan_t      *const p_scan_ctx,
                                   nrf_ble_scan_filter_type_t type,
                                   void const                *p_data)
{
    VERIFY_PARAM_NOT_NULL(p_scan_ctx);
    VERIFY_PARAM_NOT_NULL(p_data);
    
    switch(type)
    {
            #if (NRF_BLE_SCAN_NAME_CNT > 0)
    
        case SCAN_NAME_FILTER:
        {
            char *p_name = (char *)p_data;
            return nrf_ble_scan_name_filter_add(p_scan_ctx, p_name);
        }
        
        #endif
        
        #if (NRF_BLE_SCAN_SHORT_NAME_CNT > 0)
        
        case SCAN_SHORT_NAME_FILTER:
        {
            nrf_ble_scan_short_name_t *p_short_name = (nrf_ble_scan_short_name_t *)p_data;
            return nrf_ble_scan_short_name_filter_add(p_scan_ctx, p_short_name);
        }
        
        #endif
        
        #if (NRF_BLE_SCAN_ADDRESS_CNT > 0)
        
        case SCAN_ADDR_FILTER:
        {
            uint8_t *p_addr = (uint8_t *)p_data;
            return nrf_ble_scan_addr_filter_add(p_scan_ctx, p_addr);
        }
        
        #endif
        
        #if (NRF_BLE_SCAN_UUID_CNT > 0)
        
        case SCAN_UUID_FILTER:
        {
            ble_uuid_t *p_uuid = (ble_uuid_t *)p_data;
            return nrf_ble_scan_uuid_filter_add(p_scan_ctx, p_uuid);
        }
        
        #endif
        
        #if (NRF_BLE_SCAN_APPEARANCE_CNT > 0)
        
        case SCAN_APPEARANCE_FILTER:
        {
            uint16_t appearance = *((uint16_t *)p_data);
            return nrf_ble_scan_appearance_filter_add(p_scan_ctx, appearance);
        }
        
        #endif
        
        default:
            return NRF_ERROR_INVALID_PARAM;
    }
}


ret_code_t nrf_ble_scan_all_filter_remove(nrf_ble_scan_t *const p_scan_ctx)
{
    #if (NRF_BLE_SCAN_NAME_CNT > 0)
    nrf_ble_scan_name_filter_t *p_name_filter = &p_scan_ctx->scan_filters.name_filter;
    memset(p_name_filter->target_name, 0, sizeof(p_name_filter->target_name));
    p_name_filter->name_cnt = 0;
    #endif
    
    #if (NRF_BLE_SCAN_SHORT_NAME_CNT > 0)
    nrf_ble_scan_short_name_filter_t *p_short_name_filter =
        &p_scan_ctx->scan_filters.short_name_filter;
    memset(p_short_name_filter->short_name, 0, sizeof(p_short_name_filter->short_name));
    p_short_name_filter->name_cnt = 0;
    #endif
    
    #if (NRF_BLE_SCAN_ADDRESS_CNT > 0)
    nrf_ble_scan_addr_filter_t *p_addr_filter = &p_scan_ctx->scan_filters.addr_filter;
    memset(p_addr_filter->target_addr, 0, sizeof(p_addr_filter->target_addr));
    p_addr_filter->addr_cnt = 0;
    #endif
    
    #if (NRF_BLE_SCAN_UUID_CNT > 0)
    nrf_ble_scan_uuid_filter_t *p_uuid_filter = &p_scan_ctx->scan_filters.uuid_filter;
    memset(p_uuid_filter->uuid, 0, sizeof(p_uuid_filter->uuid));
    p_uuid_filter->uuid_cnt = 0;
    #endif
    
    #if (NRF_BLE_SCAN_APPEARANCE_CNT > 0)
    nrf_ble_scan_appearance_filter_t *p_appearance_filter =
        &p_scan_ctx->scan_filters.appearance_filter;
    memset(p_appearance_filter->appearance, 0, sizeof(p_appearance_filter->appearance));
    p_appearance_filter->appearance_cnt = 0;
    #endif
    
    return NRF_SUCCESS;
}


ret_code_t nrf_ble_scan_filters_enable(nrf_ble_scan_t *const p_scan_ctx,
                                       uint8_t                mode,
                                       bool                   match_all)
{
    VERIFY_PARAM_NOT_NULL(p_scan_ctx);
    
    // Check if the mode is correct.
    if((!(mode & NRF_BLE_SCAN_ADDR_FILTER)) &&
       (!(mode & NRF_BLE_SCAN_NAME_FILTER)) &&
       (!(mode & NRF_BLE_SCAN_UUID_FILTER)) &&
       (!(mode & NRF_BLE_SCAN_SHORT_NAME_FILTER)) &&
       (!(mode & NRF_BLE_SCAN_APPEARANCE_FILTER)))
        return NRF_ERROR_INVALID_PARAM;
        
    ret_code_t err_code;
    
    // Disable filters.
    err_code = nrf_ble_scan_filters_disable(p_scan_ctx);
    ASSERT(err_code == NRF_SUCCESS);
    
    nrf_ble_scan_filters_t *p_filters = &p_scan_ctx->scan_filters;
    
    // Turn on the filters of your choice.
    #if (NRF_BLE_SCAN_ADDRESS_CNT > 0)
    
    if(mode & NRF_BLE_SCAN_ADDR_FILTER)
        p_filters->addr_filter.addr_filter_enabled = true;
        
    #endif
        
    #if (NRF_BLE_SCAN_NAME_CNT > 0)
        
